# Bonus: Temperature Analysis I

In [45]:
import pandas as pd
from datetime import datetime as dt

In [27]:
# "tobs" is "temperature observations"
df = pd.read_csv('Resources/hawaii_measurements.csv')
df.head()

       station        date  prcp  tobs
0  USC00519397  2010-01-01  0.08    65
1  USC00519397  2010-01-02  0.00    63
2  USC00519397  2010-01-03  0.00    74
3  USC00519397  2010-01-04  0.00    76
4  USC00519397  2010-01-06   NaN    73

In [32]:
# Convert the date column format from string to datetime
df["date"] = pd.to_datetime(df["date"])
df

           station       date  prcp  tobs
0      USC00519397 2010-01-01  0.08    65
1      USC00519397 2010-01-02  0.00    63
2      USC00519397 2010-01-03  0.00    74
3      USC00519397 2010-01-04  0.00    76
4      USC00519397 2010-01-06   NaN    73
...            ...        ...   ...   ...
19545  USC00516128 2017-08-19  0.09    71
19546  USC00516128 2017-08-20   NaN    78
19547  USC00516128 2017-08-21  0.56    76
19548  USC00516128 2017-08-22  0.50    76
19549  USC00516128 2017-08-23  0.45    76

[19550 rows x 4 columns]

In [41]:
# Set the date column as the DataFrame index
df2 = df.set_index("date", drop=False)
df2

                station       date  prcp  tobs
date
2010-01-01  USC00519397 2010-01-01  0.08    65
2010-01-02  USC00519397 2010-01-02  0.00    63
2010-01-03  USC00519397 2010-01-03  0.00    74
2010-01-04  USC00519397 2010-01-04  0.00    76
2010-01-06  USC00519397 2010-01-06   NaN    73
...                 ...        ...   ...   ...
2017-08-19  USC00516128 2017-08-19  0.09    71
2017-08-20  USC00516128 2017-08-20   NaN    78
2017-08-21  USC00516128 2017-08-21  0.56    76
2017-08-22  USC00516128 2017-08-22  0.50    76
2017-08-23  USC00516128 2017-08-23  0.45    76

[19550 rows x 4 columns]

In [72]:
# Drop the date column
df_new = df2[["station", "prcp", "tobs"]]
df_new

                station  prcp  tobs
date
2010-01-01  USC00519397  0.08    65
2010-01-02  USC00519397  0.00    63
2010-01-03  USC00519397  0.00    74
2010-01-04  USC00519397  0.00    76
2010-01-06  USC00519397   NaN    73
...                 ...   ...   ...
2017-08-19  USC00516128  0.09    71
2017-08-20  USC00516128   NaN    78
2017-08-21  USC00516128  0.56    76
2017-08-22  USC00516128  0.50    76
2017-08-23  USC00516128  0.45    76

[19550 rows x 3 columns]

### Compare June and December data across all years

In [47]:
from scipy import stats

In [126]:
# Filter data for desired months
df_new['Year'] = df2['date'].dt.year
df_new['Month'] = df2['date'].dt.month_name()

#Alternate method

df_new_june = df_new.loc[df_new['Month']=="June",:]
june_temp = df_new_june.groupby(['Year']).mean()
june_temp = june_temp['tobs']
june_temp

Year
2010    74.925620
2011    73.938326
2012    74.000000
2013    74.599078
2014    75.027907
2015    74.990148
2016    75.175258
2017    77.219895
Name: tobs, dtype: float64

In [127]:
#Alternate method
df_new_dec = df_new.loc[df_new['Month']=="December",:]
dec_temp=df_new_dec.groupby(['Year']).mean()
dec_temp= dec_temp['tobs']
dec_temp

Year
2010    70.208511
2011    70.820628
2012    71.188073
2013    71.094017
2014    69.896861
2015    73.423913
2016    71.130000
Name: tobs, dtype: float64

In [85]:
# Create collections of temperature data
jun_ds = df_june["tobs"]
dec_ds = df_dec["tobs"]

In [88]:
print (jun_ds.describe(), dec_ds.describe())

count    1700.000000
mean       74.944118
std         3.257417
min        64.000000
25%        73.000000
50%        75.000000
75%        77.000000
max        85.000000
Name: tobs, dtype: float64 count    1517.000000
mean       71.041529
std         3.745920
min        56.000000
25%        69.000000
50%        71.000000
75%        74.000000
max        83.000000
Name: tobs, dtype: float64

In [96]:
# Run t-test. 
res = stats.ttest_ind(jun_ds, dec_ds)
display(res)

Ttest_indResult(statistic=31.60372399000329, pvalue=3.9025129038616655e-191)

In [129]:
# Alternate ttest using the yearly temp averages for June and December.
res_2 = stats.ttest_ind(june_temp, dec_temp)
display(res_2)

Ttest_indResult(statistic=6.97605237788662, pvalue=9.681543069110451e-06)

### Analysis

Two-sample method used instead of paired samples because the sample sizes are different and the average temperature from June and December cannot be paired with each other. With a p-value < 0.001, the null hypothesis can be rejected (null hypothesis = average temperature in June and December are similar). In other words, the average temperature in June and December are significantly different. June is hotter than November in Hawaii!